In [1]:
import numpy as np
import pandas as pd

np.array와 같이 pd.DataFrame도 연산이 가능합니다.<br>
DataFrame의 형태가 다른 경우 연산이 되지 않는 부분은 fill_value를 통해 특정 값으로 고정할 수 있습니다.

In [2]:
A = pd.DataFrame(np.random.randint(0,100, (3,3)))
B = pd.DataFrame(np.random.randint(0,100, (4,4)))

In [3]:
A

    0   1   2
0  60  96  83
1  68  63  80
2  13  29   5

In [4]:
B

    0   1   2   3
0  59  60  26  23
1  90  16  68  55
2  77  22  23  86
3  11  63  52  28

In [3]:
A.add(B, fill_value = 0)

       0      1     2     3
0   86.0   83.0  89.0  99.0
1  163.0  125.0  87.0  26.0
2  133.0   41.0  89.0  28.0
3   44.0   14.0  67.0  28.0

In [6]:
A.sub(B, fill_value = 0)

      0     1     2     3
0  38.0 -81.0  77.0 -99.0
1 -15.0  41.0 -47.0 -26.0
2  57.0 -13.0 -61.0 -28.0
3 -44.0 -14.0 -67.0 -28.0

In [7]:
A.mul(B, fill_value = 1)

        0       1       2     3
0  1488.0    82.0   498.0  99.0
1  6586.0  3486.0  1340.0  26.0
2  3610.0   378.0  1050.0  28.0
3    44.0    14.0    67.0  28.0

In [8]:
A.div(B, fill_value = 1)

          0         1          2         3
0  2.583333  0.012195  13.833333  0.010101
1  0.831461  1.976190   0.298507  0.038462
2  2.500000  0.518519   0.186667  0.035714
3  0.022727  0.071429   0.014925  0.035714

# DataFrame.sort_values(['index'], axis, ascending) : 정렬 함수
index : 정렬하고자 하는 기준 키값 입력<br>
axis : 행 (1) 또는 열 (0) 선택<br>
ascending : 오름차순 (True) 또는 내림차순 (False) 선택<br>

In [5]:
C = pd.DataFrame([[1,5,2],[2,7,3],[5,0,1]], index = ['a','b','c'], columns = ['x', 'y', 'z'])
C

   x  y  z
a  1  5  2
b  2  7  3
c  5  0  1

In [6]:
# 'c'행의 값에 대하여 오름차순 정렬
c_sort = C.sort_values(['c'], axis = 1, ascending = True)
c_sort

   y  z  x
a  5  2  1
b  7  3  2
c  0  1  5

In [8]:
# 'x'열의 값에 대하여 내림차순 정렬
x_sort = C.sort_values(['x'], axis = 0, ascending = False)
x_sort

   x  y  z
c  5  0  1
b  2  7  3
a  1  5  2

# 저장 : DataFrame.to_csv(PATH), 불러오기: f = pd.read_csv(PATH)

In [15]:
x_sort.to_csv('col_sort.csv')
x = pd.read_csv('col_sort.csv', index_col = 0) # index_col = 0 option은 Unnamed: 0 컬럼을 없애기 위해

In [16]:
x

   x  y  z
c  5  0  1
b  2  7  3
a  1  5  2

In [5]:
x = pd.read_csv('col_sort.csv', index_col = 0) # index_col = 0 option은 Unnamed: 0 컬럼을 없애기 위해
x

   x  y  z
c  5  0  1
b  2  7  3
a  1  5  2

In [9]:
x['w']['c'] = 10

In [10]:
x

   x  y  z   w
c  5  0  1  10
b  2  7  3   1
a  1  5  2   1